var myChart;
function areachoose(){
        getEcharts();
}
function Monthchoose(){
        MyMds();
}
function Waychoose(){
        MyMds();
}
$('#document').ready(function(){
    getEcharts();
});
function getEcharts(){
if($("#area option:selected").val()=='01'){
    require.config({
        paths: {
            echarts: './js'
        }
    });
    require(['echarts','echarts/chart/map'],
        function (ec) {
            myChart = ec.init(document.getElementById('mainMap'));
            myChart.clear();
            file_number = $("#Month option:selected").val();
            flow_way = $("#flow_in_out option:selected").val();
            myoption = {
                dataRange: {
                    min : 0,
                    max : 2000000,
                    calculable : true,
                    color: ['#ff3333', '#FF1493','#D2691E','orange', 'yellow','lime','#008000','aqua','#1E90FF'],
                    x: '15%',
                    y: '72%',
                    textStyle:{
                        color:'#fff'
                    }
                },
                series : [
                    {
                        name: '全国',
                        type: 'map',
                        roam: true,
                        hoverable: false,
                        mapType: 'china1',
                        zoom: 0.8, 
                        itemStyle:{
                            normal:{
                                borderColor:'rgba(100,149,237,1)',
                                borderWidth:0.8,
                                areaStyle:{color: '#1b1b1b'}
                            }
                        },
                        data:[
                        ],
                        geoCoord: {
                            '黑龙江':[127.7659988,47.8609009],
                            '内蒙古':[113.9169998,44.104599],
                            '新疆':[85.1810989,41.1226006],
                            '吉林':[126.1829987,43.6785011],
                            '辽宁':[122.5930023,41.3144989],
                            '甘肃':[100.9280014,37.8334999],
                            '河北':[116.1039963,39.549099],
                            '北京':[116.4029999,40.1789017],
                            '山西':[112.2730026,37.5839996],
                            '天津':[117.322998,39.3036003],
                            '青海':[96.010498,35.7527008],
                            '陕西':[108.8580017,35.2156982],
                            '宁夏':[106.1600037,37.2813988],
                            '西藏':[88.4389038,31.4997005],
                            '山东':[118.1240005,36.3353004],
                            '河南':[113.5899963,33.8862991],
                            '江苏':[119.435997,32.9924011],
                            '安徽':[117.2089996,31.8339005],
                            '四川':[103.4589996,30.5389004],
                            '湖北':[112.2450027,30.9778996],
                            '上海':[121.4150009,31.1760006],
                            '浙江':[120.038002,29.1755009],
                            '江西':[115.7070007,27.6166],
                            '湖南':[111.6969986,27.6133995],
                            '云南':[101.4860001,24.9787998],
                            '贵州':[106.8690033,26.8181992],
                            '福建':[117.9759979,26.0828991],
                            '广西':[108.7779999,23.8407001],
                            '台湾':[120.9800034,23.7521],
                            '广东':[113.4039993,23.3563995],
                            '海南':[109.7590027,19.1702995],
                            '香港':[114.1340027,22.3822002],
                            '重庆':[107.875,30.0585995],
                            '澳门':[113.564003,22.1625996],
                            '西宁':[101.4369965,36.8259010],
                            '海东':[102.3440018,36.3321991],
                            '海北':[100.3040009,37.7583008],
                            '黄南州':[101.6289978,35.0223007],
                            '海南州':[100.2570038,35.9003983],
                            '果洛':[99.4201965,34.1165009],
                            '玉树州':[94.3215027,34.2112007],
                            '海西州':[94.5313034,36.7126007],
                            '拉萨':[91.0897980,30.0373001],
                            '昌都':[97.0386963,30.7749004],
                            '山南':[92.2683029,28.3005009],
                            '日喀则':[86.4850998,29.4911995],
                            '那曲':[89.2575989,32.7364006],
                            '阿里':[82.5576019,33.0302010],
                            '林芝':[95.2422028,29.1947994]
                        },
                        markPoint : {
                            symbol:'emptyCircle',
                            symbolSize : function (v){
                                return v/1000000
                            },
                            effect : {
                                show: true,
                                shadowBlur : 0
                            },
                            itemStyle:{
                                normal:{label:{show:false}},
                                emphasis: {label:{position:'top'}}
                            },
                            data : []
                        }
                    }
                ]
        };
    test ={
        name: '省省交互作用',
        type: 'map',
        mapType: 'china1',
        data:[],
        markLine : {
            smooth:true,
            effect : {
                show: true,
                scaleSize: 1,
                period: 30,
                color: '#fff',
                shadowBlur: 10
            },
            itemStyle : {
                normal: {
                    label:{show:false},
                    borderWidth:1,
                    lineStyle: {
                        type: 'solid',
                        shadowBlur: 10
                    }
                }
            },
            data : []
        }
    };
    myoption.series.push(test);
    myChart.setOption(myoption);
    province_name = ["北京","天津","河北","山西","内蒙古","辽宁","吉林","黑龙江","上海","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","重庆","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆","台湾","香港","澳门"];
    city_name = [["北京"],["天津"],["石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水"],["太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"],["呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布"],["沈阳","大连","鞍山","抚顺","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"],["长春","吉林","四平","辽源","通化","白山","松原","白城","延边"],["哈尔滨","齐齐哈尔","鸡西","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭"],["上海"],["南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","泰州","宿迁"],["杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水"],["合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","滁州","阜阳","宿州","六安","亳州","池州","宣城"],["福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德"],["南昌","景德镇","萍乡","九江","新余","鹰潭","赣州","吉安","宜春","抚州","上饶"],["济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","莱芜","临沂","德州","聊城","滨州","菏泽"],["郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店","济源"],["武汉","黄石","十堰","宜昌","襄阳","鄂州","荆门","孝感","荆州","黄冈","咸宁","随州","恩施州","仙桃","潜江","天门","神农架"],["长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","湘西"],["广州","韶关","深圳","珠海","汕头","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"],["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左"],["海口","三亚","三沙","五指山","琼海","儋州","文昌","万宁","东方","定安县","屯昌县","澄迈县","临高县","白沙","昌江","乐东","陵水","保亭","琼中"],["重庆"],["成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","眉山","宜宾","广安","达州","雅安","巴中","资阳","甘孜","凉山"],["贵阳","六盘水","遵义","安顺","毕节","铜仁","黔西南","黔东南","黔南"],["昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","红河","文山","西双版纳","大理","德宏","怒江","迪庆"],["拉萨","昌都","山南","日喀则","那曲","阿里","林芝"],["西安","铜川","宝鸡","咸阳","渭南","延安","榆林","安康","商洛"],["兰州","嘉峪关","金昌","白银","天水","武威","张掖","平凉","酒泉","庆阳","定西","陇南","临夏","甘南"],["西宁","海东","海北","黄南州","海南州","果洛","玉树州","海西州"],["银川","石嘴山","吴忠","固原","中卫"],["乌鲁木齐","克拉玛依","吐鲁番","哈密","昌吉","博州","巴州","阿克苏","克州","喀什","和田","伊犁","塔城","阿勒泰","石河子","阿拉尔","图木舒克","五家渠"],["台湾"],["香港"],["澳门"]];
    QX_name = [];
    myChart.on('click', function(params){
            click_province = params.data.name;
            file_number = $("#Month option:selected").val();
            flow_way = $("#flow_in_out option:selected").val();
            Month_flow_Choose(file_number,click_province,flow_way);
        });
    
    });

}
else{
    require.config({
        paths: {
            echarts: './js'
        }
    });
    require(['echarts','echarts/chart/map'],function (ec) {
            myChart = ec.init(document.getElementById('mainMap'));
            myChart.clear();
            file_number = $("#Month option:selected").val();
            flow_way = $("#flow_in_out option:selected").val();
            myoption = {
                dataRange: {
                    min : 0,
                    max : 2000000,
                    calculable : true,
                    color: ['#ff3333', '#FF1493','#D2691E','orange', 'yellow','lime','#008000','aqua','#1E90FF'],
                    x: '15%',
                    y: '72%',
                    textStyle:{
                        color:'#fff'
                    }
                },
                series : [
                    {
                        name: '全国',
                        type: 'map',
                        bottom:'40px',
                        roam: true,
                        hoverable: false,
                        mapType: 'china2',
                        itemStyle:{
                            normal:{
                                borderColor:'rgba(100,149,237,0.8)',
                                borderWidth:0.8,
                                areaStyle:{color: '#1b1b1b'}
                            }
                        },
                        data:[                            
                                {
                                    name:'西宁',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4
                                        },
                                    }
                                },
                                {
                                    name:'海东',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4
                                        },
                                    }
                                },
                                {
                                    name:'海北',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4
                                        },
                                    }
                                },
                                {
                                    name:'黄南州',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'海南州',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'果洛',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'玉树州',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'海西州',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'拉萨',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'昌都',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'山南',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'日喀则',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'那曲',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'阿里',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                },
                                {
                                    name:'林芝',
                                    itemStyle: {
                                        normal: {
                                            borderColor:'rgba(124,252,0,1)',
                                            borderWidth:0.4                                        },
                                    }
                                }
                            ],
                        geoCoord: {
                            '黑龙江':[127.7659988,47.8609009],
                            '内蒙古':[112.5169998,42.504599],
                            '新疆':[85.1810989,41.1226006],
                            '吉林':[126.1829987,43.6785011],
                            '辽宁':[122.5930023,41.3144989],
                            '甘肃':[100.9280014,38.5834999],
                            '河北':[116.1039963,39.549099],
                            '北京':[116.4029999,40.1789017],
                            '山西':[112.2730026,37.5839996],
                            '天津':[117.322998,39.3036003],
                            '青海':[96.010498,35.7527008],
                            '陕西':[108.8580017,35.2156982],
                            '宁夏':[106.1600037,37.2813988],
                            '西藏':[88.4389038,31.4997005],
                            '山东':[118.1240005,36.3353004],
                            '河南':[113.5899963,33.8862991],
                            '江苏':[119.435997,32.9924011],
                            '安徽':[117.2089996,31.8339005],
                            '四川':[103.4589996,30.5389004],
                            '湖北':[112.2450027,30.9778996],
                            '上海':[121.4150009,31.1760006],
                            '浙江':[120.038002,29.1755009],
                            '江西':[115.7070007,27.6166],
                            '湖南':[111.6969986,27.6133995],
                            '云南':[101.4860001,24.9787998],
                            '贵州':[106.8690033,26.8181992],
                            '福建':[117.9759979,26.0828991],
                            '广西':[108.7779999,23.8407001],
                            '台湾':[120.9800034,23.7521],
                            '广东':[113.4039993,23.3563995],
                            '海南':[109.7590027,19.1702995],
                            '香港':[114.1340027,22.3822002],
                            '重庆':[107.875,30.0585995],
                            '澳门':[113.564003,22.1625996]
                        },
                        markPoint : {
                            symbol:'emptyCircle',
                            symbolSize : function (v){
                                return 10 + v/1000000
                            },
                            effect : {
                                show: true,
                                shadowBlur : 0
                            },
                            itemStyle:{
                                emphasis: {
                                    label:{
                                        //show:false //悬浮式不显示相关标签
                                        //position:'top'//悬浮式显示的字体位置
                                    }
                                }
                            },
                            data : []
                        }
                    }
                ]
        };
    test ={
        name: '市-省/市交互作用',
        type: 'map',
        mapType: 'china2',
        data:[],
        markLine : {
            smooth:true,
            effect : {
                show: true,
                scaleSize: 1,
                period: 30,
                color: '#fff',
                shadowBlur: 10
            },
            itemStyle : {
                normal: {
                    label:{show:false},
                    borderWidth:1,
                    lineStyle: {
                        type: 'solid',
                        shadowBlur: 10
                    }
                }
            },
            data : []
        }
    };
    myoption.series.push(test);
    myChart.setOption(myoption);
    province_name = ["北京","天津","河北","山西","内蒙古","辽宁","吉林","黑龙江","上海","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","重庆","四川","贵州","云南","拉萨","昌都","山南","日喀则","那曲","阿里","林芝","陕西","甘肃","西宁","海东","海北","黄南州","海南州","果洛","玉树州","海西州","宁夏","新疆","台湾","香港","澳门"];
    city_name = [["北京"],["天津"],["石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水"],["太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"],["呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布"],["沈阳","大连","鞍山","抚顺","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"],["长春","吉林","四平","辽源","通化","白山","松原","白城","延边"],["哈尔滨","齐齐哈尔","鸡西","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭"],["上海"],["南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","泰州","宿迁"],["杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水"],["合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","滁州","阜阳","宿州","六安","亳州","池州","宣城"],["福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德"],["南昌","景德镇","萍乡","九江","新余","鹰潭","赣州","吉安","宜春","抚州","上饶"],["济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","莱芜","临沂","德州","聊城","滨州","菏泽"],["郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店","济源"],["武汉","黄石","十堰","宜昌","襄阳","鄂州","荆门","孝感","荆州","黄冈","咸宁","随州","恩施州","仙桃","潜江","天门","神农架"],["长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","湘西"],["广州","韶关","深圳","珠海","汕头","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"],["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左"],["海口","三亚","三沙","五指山","琼海","儋州","文昌","万宁","东方","定安县","屯昌县","澄迈县","临高县","白沙","昌江","乐东","陵水","保亭","琼中"],["重庆"],["成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","眉山","宜宾","广安","达州","雅安","巴中","资阳","甘孜","凉山"],["贵阳","六盘水","遵义","安顺","毕节","铜仁","黔西南","黔东南","黔南"],["昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","红河","文山","西双版纳","大理","德宏","怒江","迪庆"],["拉萨"],["昌都"],["山南"],["日喀则"],["那曲"],["阿里"],["林芝"],["西安","铜川","宝鸡","咸阳","渭南","延安","榆林","安康","商洛"],["兰州","嘉峪关","金昌","白银","天水","武威","张掖","平凉","酒泉","庆阳","定西","陇南","临夏","甘南"],["西宁"],["海东"],["海北"],["黄南州"],["海南州"],["果洛"],["玉树州"],["海西州"],["银川","石嘴山","吴忠","固原","中卫"],["乌鲁木齐","克拉玛依","吐鲁番","哈密","昌吉","博州","巴州","阿克苏","克州","喀什","和田","伊犁","塔城","阿勒泰","石河子","阿拉尔","图木舒克","五家渠"],["台湾"],["香港"],["澳门"]];
    QX_name = ["西宁","海东","海北","黄南州","海南州","果洛","玉树州","海西州","银川","石嘴山","吴忠","固原","中卫","拉萨","昌都","山南","日喀则","那曲","阿里","林芝"];
    XZ_name = ["拉萨","昌都","山南","日喀则","那曲","阿里","林芝"];
    myChart.on('click', function(params){
        click_province = params.data.name;
        file_number = $("#Month option:selected").val();
        flow_way = $("#flow_in_out option:selected").val();
        if(QX_name.indexOf(click_province)>-1){
            Month_flow_Choose(file_number,click_province,flow_way);
        }
    });
        
    });
    }
}
