import Vue from 'vue';
import Vuex from 'vuex';
import mapData from './mudules/mapData';

Vue.use(Vuex);

const store = new Vuex.Store({
  state: {
    years: [2000, 2001, 2002, 2003, 2004, 2005, 2006,
      2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015],
    cityName: [
      ['西宁', '海东', '海北', '海南', '黄南', '果洛', '玉树', '海西', '拉萨', '昌都', '山南', '日喀则', '那曲', '阿里', '林芝'],
      ['城关区', '堆龙德庆区', '达孜区', '林周县', '当雄县', '尼木县', '曲水县', '墨竹工卡县', '桑珠孜区', '江孜县',
        '仁布县', '白朗县', '乃东区', '贡嘎县', '扎囊县'],
      ['永登县', '皋兰县', '榆中县', '靖远县', '景泰县', '安定区', '陇西县', '渭源县',
        '临洮县', '临夏市', '永靖县', '东乡县', '积石山县', '大通县', '湟中县', '湟源县', '平安县', '民和县',
        '乐都县', '互助县', '化隆县', '循化县', '海晏县', '共和县', '贵德县', '贵南县', '同仁县', '尖扎县'],
      ['康马县', '定结县', '岗巴县', '定日县', '仲巴县', '亚东县', '吉隆县', '聂拉木县', '萨嘎县', '普兰县',
        '札达县', '噶尔县', '日土县', '米林县', '墨脱县', '察隅县', '朗县', '洛扎县', '隆子县', '错那县', '浪卡子县'],
    ],
    currentYear: 2000,
  },
  getter: {
  },
  mutations: {
    setCurrentYear(state, year) {
      state.currentYear = year;
    },
  },
  modules: {
    mapData,
  },
});

export default store;
